TexasInstruments/c2000ware-core-sdk/driverlib/f2838x/examples/c28x/dsp/dsp_fpu_iir_filter_fpu64_f2838x.c
//#############################################################################
//
// FILE:   empty_sysconfig_main.c
//
// TITLE:  Empty Pinmux Example
//
// Empty SysCfg & Driverlib Example
//
// This example is an empty project setup for SysConfig and Driverlib 
// development.
//
//#############################################################################
//
//
// 
// C2000Ware v26.00.00.00
//
// Copyright (C) 2024 Texas Instruments Incorporated - http://www.ti.com
//
// Redistribution and use in source and binary forms, with or without 
// modification, are permitted provided that the following conditions 
// are met:
// 
//   Redistributions of source code must retain the above copyright 
//   notice, this list of conditions and the following disclaimer.
// 
//   Redistributions in binary form must reproduce the above copyright
//   notice, this list of conditions and the following disclaimer in the 
//   documentation and/or other materials provided with the   
//   distribution.
// 
//   Neither the name of Texas Instruments Incorporated nor the names of
//   its contributors may be used to endorse or promote products derived
//   from this software without specific prior written permission.
// 
// THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS 
// "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT 
// LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
// A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT 
// OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, 
// SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT 
// LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
// DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
// THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT 
// (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE 
// OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
// $
//#############################################################################


//
// Included Files
//
#include "driverlib.h"
#include "device.h"
#include "board.h"
#include "fpu.h"
#include "dsp.h"
#include "c2000ware_libraries.h"

const float64_t test_input[533] = {
     8.506175670838L, 11.478202551275L,  7.262634956366L,  2.067279320260L,
     1.643755060659L,  3.197307665970L,  1.498297487314L, -2.800755352218L,
    -5.467778824683L, -5.149267582677L, -3.770458657576L, -3.430550569904L,
    -5.105138594285L, -7.655210256168L, -7.494464720085L, -2.854021883573L,
     1.986465726369L,  1.682064869212L, -1.552647446242L, -0.704561794106L,
     4.662182733463L,  7.398064363860L,  4.510645950188L,  1.938025007615L,
     4.501923648327L,  8.285107030532L,  7.317409083212L,  2.254971429925L,
    -1.970886242832L, -3.035716073850L, -2.174624070013L, -1.443914871747L,
    -2.402735126479L, -4.740039773263L, -5.432270679886L, -2.672195815317L,
    -0.129623558814L, -2.334530910237L, -6.526825356245L, -5.710216949903L,
     0.037547905371L,  2.937860270705L, -0.286606507320L, -3.390794300940L,
    -0.786802891253L,  4.379244411920L,  6.394210856744L,  5.381822157884L,
     5.099491334390L,  6.570124062021L,  7.742191822450L,  6.611794092811L,
     2.491373368083L, -3.066554017348L, -6.025808204523L, -4.220842304665L,
    -1.657235578799L, -3.562647508684L, -7.755414551766L, -7.362942868322L,
    -2.132721780990L,  0.627577198335L, -2.155088096199L, -4.523028306983L,
    -1.547202261220L,  3.007044625667L,  3.305115560565L,  0.061647064216L,
    -1.853337824055L, -0.308089063797L,  3.162382557843L,  6.149690509376L,
     6.762957833906L,  5.073699143470L,  4.011096952572L,  5.453784692474L,
     5.952282589861L,  1.296023185266L, -5.406399707319L, -6.853449146673L,
    -2.917587916542L, -1.299711753376L, -5.320058091007L, -8.859474965333L,
    -6.482644021803L, -1.456669743388L,  0.459314553426L, -0.565825052411L,
    -0.653937028605L,  1.371614411034L,  3.588766035522L,  4.043692888175L,
     1.983030123537L, -1.228636568884L, -1.837725587658L,  1.999368765085L,
     5.985307729239L,  4.696652643473L,  0.259949768656L, -0.355238744023L,
     3.327291770415L,  4.294327147737L, -0.234133006352L, -4.078303862381L,
    -2.206512534356L,  1.584507176150L,  1.318141729566L, -2.488460663986L,
    -5.146191011958L, -4.618466217587L, -2.402903152791L, -0.727513994618L,
    -1.190549391883L, -3.381498384594L, -4.071409245688L, -1.205305466982L,
     1.758956441750L,  0.395775983109L, -2.583347948262L, -0.388930169163L,
     6.574840244237L, 10.157931940482L,  6.759899054502L,  2.439923445637L,
     2.799127448145L,  4.921754631690L,  3.510067001415L, -0.788230565067L,
    -3.687210721607L, -3.738883602585L, -2.760153622964L, -2.756870564224L,
    -4.650047953282L, -7.297764242118L, -7.161336765058L, -2.555078055968L,
     2.147729322997L,  1.527237131177L, -2.232285675735L, -2.087468695938L,
     2.489940523070L,  4.490931240555L,  1.084588396391L, -1.643031203698L,
     1.229714511069L,  5.810898189360L,  6.068660528150L,  2.515556225785L,
    -0.120427838464L,  0.257090156178L,  2.201061327106L,  3.497711336071L,
     2.512879167718L, -0.422995218675L, -2.178859118614L, -0.774807206779L,
     0.322811616396L, -3.220139119929L, -8.489655027708L, -8.400713454201L,
    -3.015391245276L, -0.161450420889L, -3.208698376626L, -6.018889418959L,
    -3.096018629092L,  2.359279934226L,  4.627241874740L,  3.869219590941L,
     3.908083842215L,  5.835276247571L,  7.644304738367L,  7.331380124019L,
     4.153630525751L, -0.443567658747L, -2.565505960604L, -0.194634337473L,
     2.540906256897L,  0.345122456767L, -4.595596596168L, -5.326676709288L,
    -1.448258065416L, -0.081097697496L, -4.106154910341L, -7.404171556025L,
    -4.944365272014L, -0.466837491538L,  0.142012374120L, -2.516567131061L,
    -3.719723308193L, -1.482906293576L,  2.543685324501L,  5.891637646657L,
     6.674386197624L,  5.025493112215L,  3.973380319273L,  5.503701509975L,
     6.250617342401L,  2.038429352056L, -4.051615283093L, -4.805635672861L,
    -0.226975367567L,  1.837901223052L, -2.057954134099L, -5.872382560778L,
    -4.176355330540L, -0.166482227708L,  0.534850241330L, -1.725611316790L,
    -2.885079629833L, -1.611728220237L,  0.267985009068L,  0.818727591564L,
    -0.772649085383L, -3.264308419350L, -3.060144098057L,  1.526023321308L,
     6.073002568558L,  5.091930303132L,  0.713156088827L, -0.026126617667L,
     3.461696358262L,  4.288762842576L, -0.218211574497L, -3.819084600682L,
    -1.484636988897L,  2.921720282731L,  3.306381610095L,  0.045168113824L,
    -2.306434894037L, -1.807045323657L,  0.011302433887L,  0.955880326704L,
    -0.473071993210L, -3.723679043269L, -5.412179486562L, -3.347081779755L,
    -0.894821954117L, -2.450506179694L, -5.334519069681L, -2.838697154837L,
     4.525964074117L,  8.506146339992L,  5.428551239781L,  1.328139487311L,
     1.835380572469L,  4.107749036069L,  2.942491776601L, -0.925279196009L,
    -3.159222372126L, -2.320078346794L, -0.301660776634L,  0.752135520695L,
    -0.256452782576L, -2.367405284105L, -2.191367441745L,  1.874365445427L,
     5.462198552437L,  3.252331799330L, -2.389204082902L, -4.184350535133L,
    -1.356526241364L, -0.694684975950L, -4.874103546973L, -7.740790682361L,
    -4.399018694299L,  1.151091919427L,  2.713311170996L,  0.614113810367L,
    -0.591180218503L,  1.062824961045L,  4.055561633103L,  6.157979825600L,
     5.765712161398L,  3.261241062575L,  1.823900395290L,  3.455948904899L,
     4.675056280935L,  1.093502983807L, -4.451982725902L, -4.953591121597L,
    -0.522855511785L,  1.015294757651L, -3.639050672186L, -8.210175940088L,
    -7.012094997816L, -3.031298822292L, -1.785452490871L, -2.959807219481L,
    -2.656173761816L,  0.198379396970L,  3.486407328271L,  5.019130671594L,
     3.826340571320L,  1.122176123532L,  0.603535215119L,  4.152314062259L,
     7.581571786611L,  5.611809673321L,  0.504812321609L, -0.677109238841L,
     2.576038396070L,  3.229984060860L, -1.549453604951L, -5.638550695397L,
    -4.033450744412L, -0.511448780144L, -0.980977564602L, -4.824983961261L,
    -7.253550241347L, -6.164001010457L, -3.052299077683L, -0.223747247132L,
     0.573133247351L, -0.448300942951L, -0.262814275272L,  3.018939011322L,
     5.849301327798L,  3.809999269898L, -0.283485577516L,  0.536981267545L,
     6.082697250488L,  8.411774579667L,  4.084753112146L, -0.751701129056L,
    -0.490164980638L,  1.889820672303L,  0.981839999247L, -2.688607844346L,
    -4.942562733348L, -4.404731192352L, -2.924758027252L, -2.508272369769L,
    -4.058380014064L, -6.414623759987L, -6.031622395692L, -1.232515331977L,
     3.590823790958L,  3.002427175110L, -0.813917016333L, -0.791729949082L,
     3.642146293549L,  5.532741132044L,  2.091777147922L, -0.585370027114L,
     2.383785995299L,  7.018488637727L,  7.164829681422L,  3.212678531637L,
    -0.191604211091L, -0.952516500203L, -0.411985476537L, -0.572058070648L,
    -2.777354421027L, -6.385481662556L, -8.002556026003L, -5.506422571437L,
    -2.394929361041L, -3.226715207239L, -5.481925851355L, -2.574466521789L,
     4.924829510305L,  8.774938799436L,  5.380328440824L,  0.897786492043L,
     1.092643809718L,  3.236880506082L,  2.193865922743L, -1.299783897658L,
    -2.971611889010L, -1.496847547750L,  1.092438283584L,  2.522935941404L,
     1.607090239767L, -0.723476873601L, -1.038759954432L,  2.365334097446L,
     5.260883430524L,  2.474543971543L, -3.507769577671L, -5.342243159543L,
    -2.256068754947L, -1.111141083218L, -4.708699766140L, -7.045379949796L,
    -3.366533958333L,  2.228538756177L,  3.509524623318L,  0.842697301038L,
    -1.110564307703L, -0.234887778158L,  2.110980481272L,  3.837003674748L,
     3.425472245570L,  1.275211756394L,  0.509036145722L,  3.013005864161L,
     5.154614519860L,  2.394217882236L, -2.553732185716L, -2.750524022911L,
     1.686955132336L,  2.987759090690L, -2.052573365180L, -7.048110362677L,
    -6.216762492904L, -2.487010957030L, -1.369853091726L, -2.594523892111L,
    -2.343026570525L,  0.365815447365L,  3.340000854572L,  4.359066822629L,
     2.479968219780L, -0.995314315966L, -2.234857131032L,  0.799057370301L,
     4.062373360579L,  2.371922503607L, -1.986552054434L, -2.011002697478L,
     2.669409342282L,  4.824361303834L,  1.401187017276L, -1.677363164125L,
     0.446262090351L,  3.929764031031L,  2.891610033914L, -1.939840536161L,
    -5.602746178887L, -5.796700836636L, -3.832420371139L, -1.876081939376L,
    -1.605262319749L, -2.810117849719L, -2.533272473153L,  1.005850281722L,
     4.140715066610L,  2.354779526870L, -1.590706414722L, -0.726970868081L,
     4.808810820132L,  7.159726353845L,  2.978387573878L, -1.517979110275L,
    -0.696593574247L,  2.430375212433L,  2.367425228448L, -0.489659242155L,
    -2.105553918892L, -1.230994128907L,  0.205011069076L,  0.183889655404L,
    -2.138304901284L, -5.479844037571L, -6.135642727364L, -2.262944355649L,
     1.884785714196L,  0.954873705978L, -2.856131877924L, -2.539334592074L,
     2.366168031010L,  4.765981928027L,  1.738251333031L, -0.718426872913L,
     2.240274383743L,  6.661779499775L,  6.478609341097L,  2.203336530263L,
    -1.389420944093L, -2.102651749950L, -1.229859100268L, -0.791928091288L,
    -2.218180678759L, -4.999976339552L, -5.897718231662L, -2.930279257372L,
     0.308119239445L, -0.771056648171L, -3.604145900900L, -1.496646725811L,
     5.130171113166L,  8.193469305935L,  4.230227454058L, -0.524232698925L,
    -0.295943443164L,  2.125878764499L,  1.489581689989L, -1.608775727441L,
    -3.028722612080L, -1.536779723311L,  0.807162110180L,  1.773613863656L,
     0.282084756942L, -2.588671435803L, -3.254276228835L,  0.115815202663L,
     3.362559524977L,  1.306390847928L, -3.649600547067L, -4.306180281641L,
    -0.068977919081L,  2.022609735552L, -0.975133345969L, -3.140227261035L,
     0.274323267453L,  5.232224096354L,  5.619316961619L,  1.943739517810L,
    -0.996308685875L, -0.980563656341L,  0.688222624972L,  1.923585852716L,
     1.000000000000L, -1.589116348424L,  1.000000000000L,  1.000000000000L,
     1.807689688220L, -0.917293592267L,  1.000000000000L, -1.129384861204L,
     1.000000000000L,  1.000000000000L,  1.703138978970L, -0.764114321317L,
     1.000000000000L,  1.000000000000L,  0.000000000000L,  1.000000000000L,
     0.829537745791L,  0.000000000000L,  0.156921156840L,  0.070037080256L,
     0.144885155960L, };

const float64_t test_golden[512] = {
     0.013544649591L,  0.053789346410L,  0.124276243883L,  0.237723689586L,
     0.412260934597L,  0.659519790596L,  0.977048032943L,  1.352794975672L,
     1.769208561751L,  2.199186492579L,  2.602638061564L,  2.930354784324L,
     3.130377356272L,  3.154010737097L,  2.964383542577L,  2.544255178908L,
     1.896522552501L,  1.042440207534L,  0.026619620537L, -1.078191168518L,
    -2.180491179217L, -3.187882989443L, -4.014819793845L, -4.580480069534L,
    -4.814838615903L, -4.675753914120L, -4.159210416901L, -3.294817951666L,
    -2.139154356370L, -0.775155814156L,  0.690449548792L,  2.137428943737L,
     3.444334811616L,  4.499288598199L,  5.211868263141L,  5.522874423284L,
     5.405710302136L,  4.864691326365L,  3.939533694887L,  2.709074040466L,
     1.280295546389L, -0.231523643258L, -1.712650029619L, -3.050522695354L,
    -4.140841814323L, -4.904784607643L, -5.298703950496L, -5.308970436141L,
    -4.945263025302L, -4.241133470447L, -3.254139479443L, -2.059662276998L,
    -0.743635789574L,  0.603018351297L,  1.891635481340L,  3.042232990375L,
     3.983480295382L,  4.652039076014L,  5.000855318891L,  5.009491805236L,
     4.682172022428L,  4.038418379486L,  3.113770993693L,  1.969152659099L,
     0.689715198639L, -0.630468712337L, -1.900419549518L, -3.033032769612L,
    -3.946747399742L, -4.575499820291L, -4.877940219096L, -4.839055217882L,
    -4.468872180365L, -3.800853839138L, -2.886671952354L, -1.790105088689L,
    -0.586067229933L,  0.640593787121L,  1.805617162307L,  2.837858326680L,
     3.679335649941L,  4.277848164846L,  4.590120731300L,  4.594625326522L,
     4.295321883107L,  3.712644153544L,  2.878565665330L,  1.842584940516L,
     0.675214680894L, -0.539540423349L, -1.714311707534L, -2.764211590484L,
    -3.612444847328L, -4.197279666574L, -4.475914896408L, -4.426901720974L,
    -4.056218356882L, -3.400953053842L, -2.521077990553L, -1.486506664136L,
    -0.374183826416L,  0.729186565408L,  1.735753711945L,  2.574532775744L,
     3.199150392036L,  3.581176846651L,  3.705971888862L,  3.578462690046L,
     3.226256022327L,  2.692307117905L,  2.025956605571L,  1.279207128527L,
     0.503834382695L, -0.252765703652L, -0.948995682980L, -1.549728312580L,
    -2.031535745449L, -2.386590866992L, -2.615893992409L, -2.719177883580L,
    -2.696289242869L, -2.555469479831L, -2.311084447039L, -1.972039859879L,
    -1.539777388869L, -1.019347241928L, -0.426232733557L,  0.218626085044L,
     0.892980818613L,  1.568752251967L,  2.207619252908L,  2.763551932096L,
     3.187691595309L,  3.432977213152L,  3.461642360516L,  3.252447862113L,
     2.801169663880L,  2.119324335976L,  1.240084895670L,  0.224227452844L,
    -0.848002764329L, -1.893554714680L, -2.833270031888L, -3.588887714782L,
    -4.088418852486L, -4.282695695072L, -4.155239000058L, -3.717596424521L,
    -3.002841699185L, -2.065581877384L, -0.980615606742L,  0.165418513767L,
     1.283677563344L,  2.290653437564L,  3.116506321509L,  3.711386013315L,
     4.043983785696L,  4.098150434686L,  3.877270080415L,  3.409712538087L,
     2.741470946093L,  1.921558269731L,  0.998547492897L,  0.027744636582L,
    -0.929498604843L, -1.817812769872L, -2.594219050452L, -3.222032598247L,
    -3.665721325252L, -3.895382690666L, -3.892681574603L, -3.651695392657L,
    -3.179106632625L, -2.495742803159L, -1.635378694246L, -0.642772547430L,
     0.423740956182L,  1.491017391177L,  2.480705522835L,  3.322520934251L,
     3.956513453565L,  4.328821333230L,  4.398005113288L,  4.150151706589L,
     3.603233333301L,  2.796756182368L,  1.783835590088L,  0.633344248239L,
    -0.570240989279L, -1.736883002230L, -2.781985486699L, -3.631444762036L,
    -4.225212720210L, -4.521594293958L, -4.498435483937L, -4.153318603097L,
    -3.508122326002L, -2.612003092821L, -1.533277223491L, -0.347299890805L,
     0.865132953702L,  2.013633704334L,  3.005801678265L,  3.765080984928L,
     4.239517081169L,  4.397184201062L,  4.224714700328L,  3.735561839667L,
     2.974577637918L,  2.010561802638L,  0.925472878747L, -0.192485759477L,
    -1.255666944283L, -2.185068252448L, -2.915174512761L, -3.397261289584L,
    -3.606390552730L, -3.546214913684L, -3.242201021116L, -2.730507311131L,
    -2.057192315617L, -1.283170525422L, -0.477663576737L,  0.298218829447L,
     0.998372279021L,  1.585095574548L,  2.025957438928L,  2.301433172869L,
     2.410458299471L,  2.365774803527L,  2.187507897829L,  1.901515314698L,
     1.537878696287L,  1.127355900310L,  0.699858873270L,  0.283162169451L,
    -0.103194105290L, -0.452640696498L, -0.765377533242L, -1.038455265068L,
    -1.266929544691L, -1.451620397777L, -1.596222392891L, -1.695234601118L,
    -1.731817368696L, -1.689214015792L, -1.558454217064L, -1.334719805029L,
    -1.014846621332L, -0.603599256398L, -0.119727176245L,  0.405198408558L,
     0.930665123192L,  1.411231570846L,  1.803742167242L,  2.074522780599L,
     2.199997587601L,  2.165677970486L,  1.972516883487L,  1.643583744033L,
     1.217112069698L,  0.731636849651L,  0.221824071840L, -0.275285536685L,
    -0.721845526227L, -1.091720913957L, -1.376572144107L, -1.578216923311L,
    -1.700514850620L, -1.749575458065L, -1.734692090608L, -1.664339501137L,
    -1.542671966626L, -1.369344934360L, -1.139008536891L, -0.842415560426L,
    -0.474053071576L, -0.039746982228L,  0.445936034883L,  0.966009580997L,
     1.497112315611L,  2.000470390425L,  2.425574477729L,  2.725352259502L,
     2.863607570635L,  2.810565718013L,  2.542920342301L,  2.054850946769L,
     1.366287757820L,  0.519637850900L, -0.426879835845L, -1.402656326553L,
    -2.329157524660L, -3.127208917461L, -3.722715959537L, -4.052406427426L,
    -4.074440260379L, -3.777409042404L, -3.177631796246L, -2.311290917202L,
    -1.235526568878L, -0.033577025445L,  1.193338451725L,  2.345536219034L,
     3.335943669113L,  4.088187379984L,  4.538053798784L,  4.645086363047L,
     4.401063657320L,  3.826996688483L,  2.967003255363L,  1.885644130367L,
     0.664209635953L, -0.606069908907L, -1.829656532791L, -2.912789126103L,
    -3.774830640553L, -4.358414196571L, -4.628417834442L, -4.566501774549L,
    -4.175450878107L, -3.488318591053L, -2.564688138710L, -1.475297479757L,
    -0.294203542601L,  0.897473844712L,  2.012789326894L,  2.971842850794L,
     3.712726000648L,  4.191864842287L,  4.381913191417L,  4.273698686543L,
     3.877642034675L,  3.222417925744L,  2.354655584968L,  1.337436804716L,
     0.242107975584L, -0.860634957112L, -1.900598179672L, -2.805435641737L,
    -3.509297922495L, -3.967257430640L, -4.157354428500L, -4.071140042481L,
    -3.711574969193L, -3.101975619673L, -2.289024169001L, -1.332746469917L,
    -0.296683932378L,  0.753140309402L,  1.748381121969L,  2.623686648144L,
     3.322061004402L,  3.797662678476L,  4.019721584307L,  3.975446061847L,
     3.666602066841L,  3.105716213988L,  2.321358079174L,  1.365282993429L,
     0.306802623155L, -0.780820661439L, -1.824206517880L, -2.744757283732L,
    -3.463033462988L, -3.915553373257L, -4.066149143803L, -3.903866102913L,
    -3.439740355553L, -2.710235474983L, -1.778758522730L, -0.728876117873L,
     0.345528550076L,  1.349825505472L,  2.200361770380L,  2.834665608205L,
     3.213366826889L,  3.318836818009L,  3.159819367593L,  2.775441404332L,
     2.225157764444L,  1.570825423000L,  0.869888694293L,  0.179629727254L,
    -0.445669495429L, -0.967853353524L, -1.371080225997L, -1.653968523782L,
    -1.821106987449L, -1.882826183021L, -1.855650476531L, -1.757717738663L,
    -1.604519409741L, -1.407711744343L, -1.173330400097L, -0.901420651790L,
    -0.592154583479L, -0.252119150115L,  0.109136597286L,  0.485579388837L,
     0.870045293833L,  1.243643464404L,  1.577139182734L,  1.843371170703L,
     2.021850887697L,  2.091800222875L,  2.030407823317L,  1.823058130617L,
     1.471945185836L,  0.994249544490L,  0.417829907436L, -0.219253202495L,
    -0.870046544557L, -1.482996892329L, -2.005154156604L, -2.386078779373L,
    -2.587388872494L, -2.591453414597L, -2.399048864369L, -2.022402751969L,
    -1.487631748083L, -0.841587395860L, -0.145774809944L,  0.540801519471L,
     1.170033463281L,  1.699855589874L,  2.092638083744L,  2.323825224284L,
     2.387889866233L,  2.293621832102L,  2.057480928802L,  1.701890442316L,
     1.254096504843L,  0.743494729055L,  0.201353946190L, -0.339189592128L,
    -0.848350884580L, -1.304401543109L, -1.688585493017L, -1.977521991992L,
    -2.147644631007L, -2.186691672228L, -2.094291604527L, -1.872369744472L,
    -1.523862247523L, -1.063023809659L, -0.520056915592L,  0.067163988920L,
     0.661088785775L,  1.223674917786L,  1.714840769250L,  2.096447950725L,
     2.336878974998L,  2.413582005931L,  2.316999116640L,  2.053308855007L,
     1.640243158434L,  1.101746654966L,  0.471124656631L, -0.203997424817L,
    -0.868824658928L, -1.475233310840L, -1.984234738474L, -2.357982098299L,
    -2.560144704616L, -2.568203103677L, -2.380425436925L, -2.010066147210L,
    -1.479578440387L, -0.822990918504L, -0.088131623859L,  0.667606127767L,
     1.382951495768L,  1.997192317332L,  2.456762221979L,  2.721426368919L,
     2.764252357555L,  2.570834909634L,  2.146841445299L,  1.526429667854L,
     0.766864631253L, -0.065723434351L, -0.901401927451L, -1.662793847043L,
    -2.270774237596L, -2.662168120083L, -2.801427333738L, -2.678273184761L,
    -2.303782259152L, -1.712938573341L, -0.965350815130L, -0.138001380347L,
     0.684576904953L,  1.419334990613L,  1.995480483996L,  2.363518353965L,
     2.496048011322L,  2.385560014438L,  2.048669426979L,  1.530225022392L,
     0.893768126268L,  0.204343312891L, -0.477618284501L, -1.091653679995L,
    -1.580216998218L, -1.902507590710L, -2.041888602839L, -1.999586250505L,
    -1.787759227374L, -1.430469670330L, -0.964634203683L, -0.434997720370L,
};

#define TEST_SIZE       (512U)
#define NUM_SOS         (3U)    // Number of Second Order Stages (biquad)
#define FILTER_ORDER    (NUM_SOS<<1)

float64u_t gold, errld;
float64_t in, out;
uint16_t pass = 0U, fail = 0U;
float64_t tolerance = 1.0e-6;
float64_t coeffs_B[NUM_SOS*3U];
float64_t coeffs_A[NUM_SOS*3U];
float64_t scaleFactors[NUM_SOS];
float64_t delayLine[NUM_SOS*4U];
float64_t test_output[TEST_SIZE];

float64_t *denCoeffs = coeffs_A;
float64_t *numCoeffs = coeffs_B;
float64_t *delayBuff = delayLine;
float64_t *inBuff = &in;
float64_t *outBuff = &out;
float64_t *scalePtr = scaleFactors;

//
// Main
//
void main(void)
{
    Device_init();
    Device_initGPIO();
    Interrupt_initModule();
    Interrupt_initVectorTable();
    Board_init();
    C2000Ware_libraries_init();

    uint16_t i;
    float64_t *p_cb, *p_ca;

    p_cb = &test_input[TEST_SIZE];
    p_ca = p_cb + 3UL;

    for(i = 0U; i < NUM_SOS; i++)
    {
        memcpy(&coeffs_B[3U*i], p_cb, 3U*sizeof(float64_t));
        memcpy(&coeffs_A[3U*i], p_ca, 3U*sizeof(float64_t));
        p_cb += 6UL;
        p_ca += 6UL;
    }
    memcpy(scaleFactors, &test_input[TEST_SIZE+(6U*NUM_SOS)],
            NUM_SOS*sizeof(float64_t));

    //myIIR0_handle->init(myIIR0_handle);

    for(i = 0U; i < TEST_SIZE; i++)
    {
        out  = 0;
        in   = test_input[i];
        myIIR0_handle->calc(myIIR0_handle);
        test_output[i] = out;
        gold.f64 = test_golden[i];
        errld.f64 = fabsf(out - gold.f64);

        if(errld.f64 < tolerance)
        {
            pass++;
        }
        else
        {
            fail++;
        }
    }

    while(1);
}

//
// End of File
//
